import pandas as pd

from app.ml_model import train_model as train_logreg
from app.ml_model_svm import train_model as train_svm
from app.ml_model_nb import train_model as train_nb


df = pd.read_csv("Документы new new.csv", sep=";")

texts = df["texts"].tolist()
labels = df["labels"].tolist()

label_to_name = {
    "8.2.2.1.1-01": "Положения об отделе",
    "8.2.2.1.1-02": "Должностные инструкции работников",
    "8.2.2.1.1-03": "Протоколы ЛЭК ВКР Бизнес-информатика",
    "8.2.2.1.1-04": "Протоколы ЛЭК ВКР Программная инженерия",
    "8.2.2.1.1-05": "Итоговые заседания президиума ГЭК Бизнес-информатика",
    "8.2.2.1.1-06": "Итоговые заседания президиума ГЭК Программная инженерия",
    "8.2.2.1.1-07": "Комиссия концепции ВКР англ. Бизнес-информатика",
    "8.2.2.1.1-08": "Комиссия концепции ВКР англ. Программная инженерия",
    "8.2.2.1.1-09": "Отчет председателя ГЭК Бизнес-информатика",
    "8.2.2.1.1-10": "Отчет председателя ГЭК Программная инженерия",
    "8.2.2.1.1-11": "Служебные записки отдела",
    "8.2.2.1.1-13": "Акты по работе со студентами",
    "8.2.2.1.1-14": "Акты приема-передачи документов",
    "8.2.2.1.1-15": "Документы проектной деятельности студентов",
    "8.2.2.1.1-32": "Номенклатура дел отдела",
}

labels = [label_to_name[x] for x in labels]

print("\nОбучение Logistic Regression...")
train_logreg(texts, labels)

print("\nОбучение Linear SVM...")
train_svm(texts, labels)

print("\nОбучение Naive Bayes...")
train_nb(texts, labels)

print("\nВсе модели обучены.")